export const siteConfig = {
  name: "刘立鹏",
  title: "软件工程、区块链玩家",
  description: "Portfolio website of 刘立鹏",
  accentColor: "#1d4ed8",
  social: {
    email: "2892667683@qq.com",
    linkedin: "",
    twitter: "",
    github: "",
  },
  aboutMe:"1、具备扎实的软件开发基础，熟悉多语言编程，能够根据业务场景灵活选择技术栈。2、拥有全栈开发经验，可独立完成从后端接口设计到前端交互实现。3、具备 区块链与 Web3 开发能力，参与过智能合约（Solidity）交易机器人开发，深入理解 DeFi、Uniswap V2/V3。4、实践过高并发爬虫与实时数据处理系统，掌握 asyncio 并发、WebSocket 通信、账号池管理 等技术，能够支撑秒级数据采集与展示。5、熟悉 Linux 环境运维与项目部署，掌握 Git 版本控制与团队协作，具备良好的工程化开发习惯。7、具备完整项目实战经验，主导/参与过 B2C 电商平台、推特监听系统、自动化交易机器人等项目，能够推动项目从需求分析到部署上线。8、善于 解决复杂技术问题，能够在不依赖框架的情况下实现底层逻辑，并注重 日志追踪、性能优化与可维护性。",
  skills: ["专注后端，偶尔写写前端","Python", "Flask","爬虫入门", "Solidity","Web3","Java","C++","C","Git","Linux","JavaScript","Vue","Docker","常用办公软件"],
  projects: [
    {
      name: "推特监听与实时数据处理系统",
      description:
        "独立负责系统整体架构与后端核心逻辑，基于 Flask + Vue 搭建实时数据交互服务。实现账号池与任务调度机制，支持上千个 Twitter 账号轮换登录规避风控；结合 asyncio 并发与 WebSocket 通信，实现十秒级推文采集与展示。开发内存管理模块，完成数据分类、存储与查询，显著提升系统扩展性与稳定性。",
      link: "",
      skills: ["Flask", "Vue", "Asyncio", "WebSocket", "Twitter API","多线程","多协程"]
    },
    {
      name: "推特注册机",
      description:
        "参与开发注册机,使用PlayWright操作无头浏览器，结合解验证码网站，绕过推特人际验证，实现账号批量注册",
      link: "",
      skills: ["Python", "爬虫","PlayWright", "IP轮转","人机验证"],
    },
    {
      name: "电动车智能识别系统",
      description:
        "参与武汉工程大学智能机器人湖北省重点实验室主办的 Coding Master 夏令营，担任 Web 后端开发。搭建后端服务支持图片上传与处理，调用 YOLOv8 模型进行目标检测，返回识别结果并实时展示到前端网页。提升了系统的交互体验与识别精度。",
      link: "",
      skills: ["Flask", "YOLOv8", "Web后端", "目标检测"]
    },
    {
      name: "文档管理系统",
      description:
        "外包项目，结合客户需求，真对特定场景需要的不同类别文件共享开发，实现文件的分类上传，支持登陆注册、多用户增删改查、排序、下载，界面设计简洁优雅、加入审核机制和管理员机制，提高团队协同",
      link: "",
      skills: ["C++", "Qt", "TCP"],
    },
    {
      name: "小型编译器",
      description:
        "独立完成词法分析器、语法分析器与语义填充模块的设计与实现。采用语法制导翻译方法，支持精确到行列的错误提示，成功实现了完整的小型编译器。项目涵盖编译原理核心流程，体现了较强的系统设计与实现能力。",
      link: "",
      skills: ["C++", "编译原理", "语法分析", "错误处理"]
    },
    
  ],
  experience: [
    {
      company: "湖北繁森科技有限公司",
      title: "区块链、后端开发",
      dateRange: "2024.12～2025.8",
      bullets: [
        "主导的许多项目，推动公司实现盈利增长",
        "利用爬虫和自动化脚本，减少公司需要投入的人力成本",
        "自主开发简易合约聚合器工具，优化买入路径并提升交易效率",
        "设计并实现推特实时监听系统，确保公司即时获取一手消息",
        "参与开发推特注册机、降低账号成本"
      ],
    },
  ],
  education: [
    {
      school: "武汉工程大学",
      degree: "计算机科学全日制本科",
      dateRange: "2022 - 2026",
      achievements: [
        "GPA: 3.6/4.5",
        "CET-4",
        "荣誉奖项：全国大学生商务英语竞赛全国三等奖",
      ],
    },
  ],
};
